[x111,y111]=fmins(1,1,1,[1;1],1,0.1) %梯度法-黄金分割法-函数1-初始点[1,1]-初始步长1-精度0.1
[x121,y121]=fmins(1,2,1,[1;1],1,0.1) %梯度法-成功失败法-函数1-初始点[1,1]-初始步长1-精度0.1
[x131,y131]=fmins(1,3,1,[1;1],1,0.1) %梯度法-三点二次插值法-函数1-初始点[1,1]-初始步长1-精度0.1

[x112,y112]=fmins(1,1,2,[-2.5;4.25],1,0.01) %梯度法-黄金分割法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x122,y122]=fmins(1,2,2,[-2.5;4.25],1,0.01) %梯度法-成功失败法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x132,y132]=fmins(1,3,2,[-2.5;4.25],1,0.01) %梯度法-三点二次插值法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01

[x211,y211]=fmins(2,1,1,[1;1],1,0.1) %阻尼牛顿法-黄金分割法-函数1-初始点[1,1]-初始步长1-精度0.1
[x221,y221]=fmins(2,2,1,[1;1],1,0.1) %阻尼牛顿法-成功失败法-函数1-初始点[1,1]-初始步长1-精度0.1
[x231,y231]=fmins(2,3,1,[1;1],1,0.1) %阻尼牛顿法-三点二次插值法-函数1-初始点[1,1]-初始步长1-精度0.1

[x212,y212]=fmins(2,1,2,[-2.5;4.25],1,0.01) %阻尼牛顿法-黄金分割法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x222,y222]=fmins(2,2,2,[-2.5;4.25],1,0.01) %阻尼牛顿法-成功失败法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x232,y232]=fmins(2,3,2,[-2.5;4.25],1,0.01) %阻尼牛顿法-三点二次插值法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01

[x311,y311]=fmins(3,1,1,[1;1],1,0.1) %共轭梯度法-黄金分割法-函数1-初始点[1,1]-初始步长1-精度0.1
[x321,y321]=fmins(3,2,1,[1;1],1,0.1) %共轭梯度法-成功失败法-函数1-初始点[1,1]-初始步长1-精度0.1
[x331,y331]=fmins(3,3,1,[1;1],1,0.1) %共轭梯度法-三点二次插值法-函数1-初始点[1,1]-初始步长1-精度0.1

[x312,y312]=fmins(3,1,2,[-2.5;4.25],1,0.01) %共轭梯度法-黄金分割法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x322,y322]=fmins(3,2,2,[-2.5;4.25],1,0.01) %共轭梯度法-成功失败法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x332,y332]=fmins(3,3,2,[-2.5;4.25],1,0.01) %共轭梯度法-三点二次插值法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01

[x411,y411]=fmins(4,1,1,[1;1],1,0.1) %共轭梯度法-黄金分割法-函数1-初始点[1,1]-初始步长1-精度0.1
[x421,y421]=fmins(4,2,1,[1;1],1,0.1) %共轭梯度法-成功失败法-函数1-初始点[1,1]-初始步长1-精度0.1
[x431,y431]=fmins(4,3,1,[1;1],1,0.1) %共轭梯度法-三点二次插值法-函数1-初始点[1,1]-初始步长1-精度0.1

[x412,y412]=fmins(4,1,2,[-2.5;4.25],1,0.01) %共轭梯度法-黄金分割法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x422,y422]=fmins(4,2,2,[-2.5;4.25],1,0.01) %共轭梯度法-成功失败法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x432,y432]=fmins(4,3,2,[-2.5;4.25],1,0.01) %共轭梯度法-三点二次插值法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01

[x511,y511]=fmins(5,1,1,[1;1],1,0.1) %变尺度法-黄金分割法-函数1-初始点[1,1]-初始步长1-精度0.1
[x521,y521]=fmins(5,2,1,[1;1],1,0.1) %变尺度法-成功失败法-函数1-初始点[1,1]-初始步长1-精度0.1
[x531,y531]=fmins(5,3,1,[1;1],1,0.1) %变尺度法-三点二次插值法-函数1-初始点[1,1]-初始步长1-精度0.1

[x512,y512]=fmins(5,1,2,[-2.5;4.25],1,0.01) %变尺度法-黄金分割法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x522,y522]=fmins(5,2,2,[-2.5;4.25],1,0.01) %变尺度法-成功失败法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x532,y532]=fmins(5,3,2,[-2.5;4.25],1,0.01) %变尺度法-三点二次插值法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01

[x611,y611]=fmins(6,1,1,[1;1],1,0.1) %单纯形法-黄金分割法-函数1-初始点[1,1]-初始步长1-精度0.1
[x621,y621]=fmins(6,2,1,[1;1],1,0.1) %单纯形法-成功失败法-函数1-初始点[1,1]-初始步长1-精度0.1
[x631,y631]=fmins(6,3,1,[1;1],1,0.1) %单纯形法-三点二次插值法-函数1-初始点[1,1]-初始步长1-精度0.1

[x612,y612]=fmins(6,1,2,[-2.5;4.25],1,0.01) %单纯形法-黄金分割法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x622,y622]=fmins(6,2,2,[-2.5;4.25],1,0.01) %单纯形法-成功失败法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
[x632,y632]=fmins(6,3,2,[-2.5;4.25],1,0.01) %单纯形法-三点二次插值法-函数2-初始点[-2.5,4.25]-初始步长1-精度0.01
