disp('黄金分割法');

[des1_1_a, t1_1_a] = fmin(1,1,3,0.001);     %法1黄金分割法 函数1 初始值3 精度0.001
[des1_1_b, t1_1_b] = fmin(1,1,3,0.000001);  %法1黄金分割法 函数1 初始值3 精度0.000001
[des1_2_a, t1_2_a] = fmin(1,2,100,0.001);   %法1黄金分割法 函数2 初始值100 精度0.001
[des1_2_b, t1_2_b] = fmin(1,2,100,0.000001);%法1黄金分割法 函数2 初始值100 精度0.000001
[des1_3_a, t1_3_a] = fmin(1,3,10,0.001);   %法1黄金分割法 函数2 初始值100 精度0.001
[des1_3_b, t1_3_b] = fmin(1,3,10,0.000001);%法1黄金分割法 函数2 初始值100 精度0.000001

disp('最终结果:');
disp([des1_1_a,des1_1_b,des1_2_a,des1_2_b,des1_3_a,des1_3_b]);
disp('迭代次数:');
disp([t1_1_a,t1_1_b,t1_2_a,t1_2_b,t1_3_a,t1_3_b]);